# Toposolid Boolean Perturbation Failures Properties

Source: https://www.revitapidocs.com/2026/381148be-c446-cf44-c8ef-a0ccd2efa7a2.htm

---

| Toposolid Boolean Perturbation Failures Properties |
| --- |

The BuiltInFailures ToposolidBooleanPerturbationFailures type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | NonPerturbationBooleanFailed | Boolean operation failed without perturbation. |

Top See Also

#### Reference

BuiltInFailures ToposolidBooleanPerturbationFailures Class Autodesk.Revit.DB Namespace